app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    flash[:note] = "Your have successfully created a product."
    if @product.save
---
INSERT INTO "products" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-10-10 20:20:07.937115"], ["updated_at", "2017-10-10 20:20:07.937115"]]