app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @product = Product.find(params[:product_id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "reviews" ("username", "comment", "created_at", "updated_at", "product_id") VALUES (?, ?, ?, ?, ?)  [["username", "gianlala"], ["comment", "alalalal"], ["created_at", "2017-10-31 21:14:50.519588"], ["updated_at", "2017-10-31 21:14:50.519588"], ["product_id", 6]]
---
  def create
    # @review = Product.review.find(params[:product_id])
    puts "what ?"
    # @review = Review.new

    @product = Product.find(params[:product_id])
    puts "what ?"
    @review = @product.reviews.new(review_params)
    # @review = @product.reviews.new
    # @review.username = params[:review][:username]
    # @review.comment = params[:review][:comment]
    # @review.assign_attributess(review_params)
    @review.save